Autodesk.Revit.DB.IExportContext2D.OnFaceSilhouette2D(Autodesk.Revit.DB.FaceSilhouetteNode)
This method is called when a Face silhouette is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
Note: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Face silhouette.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this face silhouette, or otherwise return RenderNodeAction.Skip.
Note: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.
Since:
2020

Autodesk.Revit.DB.IExportContext2D.OnFaceEdge2D(Autodesk.Revit.DB.FaceEdgeNode)
This method is called when a Face edge is being output.
Remarks:
Note that this method is invoked only if the custom exporter
was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
Note: if the export is performed for the view in non-Wireframe display style
this method will be called regardless of whether the object will be eventially output,
i.e. even if it's occluded by another element.
node:
An output node that represents a Face edge.
Returns:
Return RenderNodeAction.Proceed if you wish to receive tessellated geometry
(line or polyline segments) for this face edge, or otherwise return RenderNodeAction.Skip.
Note: if the export is performed for the view in non-Wireframe display style
tesselated geometry will be output regardless of the return value.
Since:
2020

Autodesk.Revit.DB.IExportContext2D.OnElementEnd2D(Autodesk.Revit.DB.ElementNode)
This method marks the end of an element being exported.
Remarks:
For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets.
Therefore the argument to this method is ElementNode that has both element ID and the host document.
node:
An output node that represents an element.
Since:
2020

Autodesk.Revit.DB.IExportContext2D.OnElementBegin2D(Autodesk.Revit.DB.ElementNode)
This method marks the beginning of an element to be exported.
Remarks:
For views having non-Wireframe display style, geometry of elements is output outside of view, instance and link begin/end brackets.
Therefore the argument to this method is ElementNode that has both element ID and the host document.
node:
Node representing the element that is about to start being exported. Contains element ID and document.
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2020

Autodesk.Revit.DB.IExportContext2D
An interface that is used in custom export to export 2D views of a Revit model.
Remarks:
An instance of a class that implements this interface is passed in as a
parameter of the Autodesk.Revit.DB.CustomExporter constructor.
The interface methods are then called at times of drawing entities that are
currently visible in the view being exported.
With this type of export context used to perform a custom export,
Revit will traverse the model and output the model's geometry
as if in the process of regular displaying or exporting a 2D View.
It means that any geometry which is visible in an open view
(taking any current visibility setting applicable to the view)
will be processed and output.
Optionally, annotation objects are also output.
Note 1. Curves passed to calls Autodesk.Revit.DB.IExportContext2D.OnFaceEdge2D(Autodesk.Revit.DB.FaceEdgeNode) and Autodesk.Revit.DB.IExportContext2D.OnFaceSilhouette2D(Autodesk.Revit.DB.FaceSilhouetteNode) may be partially duplicating each other.
Note 2. If element E is a FamilyInstance and it contains an imported instance then:
between the calls to OnElementBegin2D/OnElementEnd2D for element E there will be calls to OnInstanceBegin/OnInstanceEnd with the "node" argument pointing to the element with its symbol being of category BuiltInCategories.OST_ImportObjectStylesall geometry exported for the element E has to be additionally subject to the transform T=E.GetTotalTransform()
Since:
2020